IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
	if (ConnHdl == BLE_CONN_HANDLE_INVALID)
	{
		return false;
	}

	for (int i = 0; i < CONFIG_NRF_SDH_BLE_TOTAL_LINK_COUNT; i++)
	{
		if (s_SecurePendingHdl[i] == ConnHdl)
		{
			return true;
		}
		if (freeIdx < 0 && s_SecurePendingHdl[i] == BLE_CONN_HANDLE_INVALID)
		{
			freeIdx = i;
		}
	}

	if (freeIdx < 0)
	{
		return false;
	}

	s_SecurePendingHdl[freeIdx] = ConnHdl;
	return true;
}

static void SecurePendingRemove(uint16_t ConnHdl)
{
	for (int i = 0; i < CONFIG_NRF_SDH_BLE_TOTAL_LINK_COUNT; i++)
	{
		if (s_SecurePendingHdl[i] == ConnHdl)
		{
			s_SecurePendingHdl[i] = BLE_CONN_HANDLE_INVALID;
		}
	}
}

static uint16_t SecurePendingTake()
{
	for (int i = 0; i < CONFIG_NRF_SDH_BLE_TOTAL_LINK_COUNT; i++)
	{
		uint16_t connHdl = s_SecurePendingHdl[i];
		if (connHdl != BLE_CONN_HANDLE_INVALID)
		{
			s_SecurePendingHdl[i] = BLE_CONN_HANDLE_INVALID;
			return connHdl;
		}
	}

	return BLE_CONN_HANDLE_INVALID;
}

// --- Helper functions ---

int8_t GetValidTxPower(int TxPwr)
{
	int8_t retval = s_TxPowerdBm[0];

	for (int i = 1; i < s_NbTxPowerdBm; i++)
	{
		if (s_TxPowerdBm[i] > TxPwr)
			break;
		retval = s_TxPowerdBm[i];
	}

	return retval;
}

// --- Conn params event handler ---

static void on_conn_params_evt(const struct ble_conn_params_evt *p_evt)
{
	if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_ERROR)
	{
		// The event names the link whose negotiation failed. Reading the active
		// handle instead dropped whichever link happened to be current.
		sd_ble_gap_disconnect(p_evt->conn_handle,
							  BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
	}
}

// Central GATT client discovery (S145). Single active discovery at a time.
// Bodies live in the Central / Observer section near BtAppConnect.
static void BtAppDiscPrimSrvcRsp(const ble_gattc_evt_t *pEvt);
static void BtAppDiscCharRsp(const ble_gattc_evt_t *pEvt);
static void BtAppDiscDescRsp(const ble_gattc_evt_t *pEvt);

// ===========================================================================
// SMP user interaction bridge (sdk-nrf-bm / Peer Manager port, S145).
//
// The SoftDevice owns the SMP exchange and surfaces the user steps as GAP
// events: BLE_GAP_EVT_PASSKEY_DISPLAY (Numeric Comparison when match_request is
// set, otherwise Passkey Entry display) and BLE_GAP_EVT_AUTH_KEY_REQUEST
// (Passkey Entry input). These are bridged to the same BtSmp* interaction API
// through sd_ble_gap_auth_key_reply. Strong reply functions below replace the
// generic weak implementations; an application replaces the weak UI functions.
// ===========================================================================

// SoftDevice passkey octets are six ASCII digits, most significant first.
// Convert to the six digit integer used by the BtSmp interaction API.
static uint32_t BmPasskeyToVal(const uint8_t *pAscii)
{
	uint32_t v = 0;
	for (int i = 0; i < BLE_GAP_PASSKEY_LEN; i++)
	{
		v = v * 10 + (uint32_t)(pAscii[i] - '0');
	}
	return v;
}

// Convert the six digit integer to six ASCII digits, most significant first,
// zero padded, for sd_ble_gap_auth_key_reply.
static void BmPasskeyFromVal(uint32_t Val, uint8_t *pAscii)
{
	for (int i = BLE_GAP_PASSKEY_LEN - 1; i >= 0; i--)
	{
		pAscii[i] = (uint8_t)('0' + (Val % 10));
		Val /= 10;
	}
}

// Resume Numeric Comparison. Confirm true reports a match (reply PASSKEY type
// with no key), false reports no match (reply NONE) and aborts pairing.
void BtSmpNumericComparisonReply(uint16_t ConnHdl, bool Confirm)
{
	(void)sd_ble_gap_auth_key_reply(ConnHdl,
			Confirm ? BLE_GAP_AUTH_KEY_TYPE_PASSKEY : BLE_GAP_AUTH_KEY_TYPE_NONE,
			NULL);
}

// Resume Passkey Entry on the input side. A value in 0..999999 is sent as six
// ASCII digits; a value above that range cancels with a NONE reply.
void BtSmpPasskeyReply(uint16_t ConnHdl, uint32_t Passkey)
{
	if (Passkey > 999999u)
	{
		(void)sd_ble_gap_auth_key_reply(ConnHdl, BLE_GAP_AUTH_KEY_TYPE_NONE, NULL);
		return;
	}

	uint8_t ascii[BLE_GAP_PASSKEY_LEN];
	BmPasskeyFromVal(Passkey, ascii);
	(void)sd_ble_gap_auth_key_reply(ConnHdl, BLE_GAP_AUTH_KEY_TYPE_PASSKEY, ascii);
}

// LE Secure Connections OOB data (strong overrides of the generic weak API).
// The public staging API has no connection handle, so one staged peer set is
// bound to the first link that consumes it. A second concurrent OOB procedure
// is rejected rather than overwriting data already owned by another link.
static ble_gap_lesc_oob_data_t s_BtAppPeerOob;
static bool s_BtAppPeerOobValid = false;
static uint16_t s_BtAppPeerOobHdl = BLE_CONN_HANDLE_INVALID;

typedef struct __Bt_Smp_Bm_Auth_Cfg {
	uint8_t IoCaps;
	uint8_t AuthReq;
	bool bSet;
} BtSmpBmAuthCfg_t;

static BtSmpBmAuthCfg_t s_BtSmpAuthCfg;

void BtSmpAuthConfig(uint8_t IoCaps, uint8_t AuthReq)
{
	if (IoCaps > BT_SMP_IOCAPS_KEYBOARD_DISPLAY)
	{
		return;
	}
	s_BtSmpAuthCfg.IoCaps = IoCaps;
	s_BtSmpAuthCfg.AuthReq = (uint8_t)(AuthReq | BT_SMP_AUTHREQ_SC);
	s_BtSmpAuthCfg.bSet = true;
}

static void BtSmpOobDataClearInternal()
{
	s_BtAppPeerOobValid = false;
	s_BtAppPeerOobHdl = BLE_CONN_HANDLE_INVALID;
	CryptoSecureWipe(&s_BtAppPeerOob, sizeof(s_BtAppPeerOob));
}

static void BtSmpOobDataClearConn(uint16_t ConnHdl)
{
	if (s_BtAppPeerOobValid && s_BtAppPeerOobHdl == ConnHdl)
	{
		BtSmpOobDataClearInternal();
	}
}

static ble_gap_lesc_oob_data_t *BtAppOobPeerDataHandler(uint16_t ConnHdl)
{
	if (!s_BtAppPeerOobValid)
	{
		DEBUG_PRINTF("SEC: no OOB peer data, pairing will fail\r\n");
		return NULL;
	}

	if (s_BtAppPeerOobHdl != BLE_CONN_HANDLE_INVALID &&
		s_BtAppPeerOobHdl != ConnHdl)
	{
		DEBUG_PRINTF("SEC: OOB data busy on hdl=%u, reject hdl=%u\r\n",
			s_BtAppPeerOobHdl, ConnHdl);
		return NULL;
	}

	BtDevice_t *pPeer = BtPeerFindByHdl(ConnHdl);
	if (pPeer == nullptr)
	{
		DEBUG_PRINTF("SEC: no peer record for OOB hdl=%u\r\n", ConnHdl);
		return NULL;
	}

	s_BtAppPeerOobHdl = ConnHdl;
	s_BtAppPeerOob.addr.addr_type = pPeer->Conn.PeerAddrType;
	memcpy(s_BtAppPeerOob.addr.addr, pPeer->Conn.PeerAddr, 6);

	return &s_BtAppPeerOob;
}

int BtSmpOobLocalDataGen(BtHciDevice_t * const pDev, uint8_t * const pRand, uint8_t * const pConf)
{
	(void)pDev;

	if (pRand == NULL || pConf == NULL)
	{
		return -1;
	}
	if (!BtLescOobLocalGen())
	{
		return -1;
	}

	ble_gap_lesc_oob_data_t *p = BtLescOobLocalGet();
	if (p == NULL)
	{
		return -1;
	}

	memcpy(pRand, p->r, 16);
	memcpy(pConf, p->c, 16);

