IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
	return 0;
}

void BtSmpOobPeerDataSet(const uint8_t * const pRand, const uint8_t * const pConf)
{
	if (pRand == NULL || pConf == NULL)
	{
		return;
	}

	if (s_BtAppPeerOobValid && s_BtAppPeerOobHdl != BLE_CONN_HANDLE_INVALID &&
		BtPeerFindByHdl(s_BtAppPeerOobHdl) != nullptr)
	{
		DEBUG_PRINTF("SEC: OOB data already owned by hdl=%u\r\n",
			s_BtAppPeerOobHdl);
		return;
	}

	BtSmpOobDataClearInternal();
	memcpy(s_BtAppPeerOob.r, pRand, 16);
	memcpy(s_BtAppPeerOob.c, pConf, 16);
	s_BtAppPeerOobValid = true;
}

void BtSmpOobDataClear(void)
{
	BtSmpOobDataClearInternal();
}

// Weak defaults. With no application override the only safe action is to reject,
// so the user interaction cannot be performed silently. An application that can
// display or input overrides these.
__attribute__((weak)) void BtSmpNumericComparison(uint16_t ConnHdl, uint32_t Value)
{
	(void)Value;
	BtSmpNumericComparisonReply(ConnHdl, false);
}

__attribute__((weak)) void BtSmpPasskeyDisplay(uint16_t ConnHdl, uint32_t Passkey)
{
	(void)Passkey;
	BtSmpPasskeyReply(ConnHdl, BT_SMP_PASSKEY_INVALID);
}

__attribute__((weak)) void BtSmpPasskeyRequest(uint16_t ConnHdl)
{
	BtSmpPasskeyReply(ConnHdl, BT_SMP_PASSKEY_INVALID);
}

// --- BLE event dispatch (registered as observer) ---

static void ble_evt_dispatch(const ble_evt_t *p_ble_evt, void *p_context)
{
	uint32_t err_code;
	const ble_gap_evt_t *p_gap_evt = &p_ble_evt->evt.gap_evt;

	DEBUG_PRINTF("evt: 0x%x\r\n", p_ble_evt->header.evt_id);
	switch (p_ble_evt->header.evt_id)
	{
		case BLE_GAP_EVT_CONNECTED:
		{
			BtAppConnLedOn();
			// Own address not stamped: SMP runs in the S145 host, not the
			// IOsonata toolbox, so the record is left for the
			// BtSmpLocalAddrGet fallback.
			// The connected event reports this device's role on the new link
			// (BLE_GAP_ROLE_PERIPH 1, BLE_GAP_ROLE_CENTRAL 2). The peer
			// record stores it in the HCI encoding (BT_CONN_ROLE_*); the
			// config bitmask previously stored here is not a link role at
			// all and made the record unusable on a mixed-role device.
			uint8_t role = p_gap_evt->params.connected.role;
			BtPeerConnected(p_gap_evt->conn_handle,
							   role == BLE_GAP_ROLE_CENTRAL ?
							   BT_CONN_ROLE_CENTRAL :
							   role == BLE_GAP_ROLE_PERIPH ?
							   BT_CONN_ROLE_PERIPHERAL : BT_CONN_ROLE_UNKNOWN,
							   p_gap_evt->params.connected.peer_addr.addr_type,
							   (uint8_t *)p_gap_evt->params.connected.peer_addr.addr,
							   0, NULL);

			// A peripheral-role connection consumes the running connectable
			// advertising set. Mark it stopped before checking remaining capacity.
			if (role == BLE_GAP_ROLE_PERIPH)
			{
				BtAdvBmConnected();
			}

			g_BtAppData.State = BTAPP_STATE_CONNECTED;
			BtAppEvtConnected(p_ble_evt->evt.gap_evt.conn_handle);

			// Start security from the main loop. Peer Manager and LESC work
			// must not run in the SoftDevice event interrupt.
			if (g_BtAppData.AppDevice.bSecure &&
				!SecurePendingAdd(p_gap_evt->conn_handle))
			{
				DEBUG_PRINTF("SEC: pending queue full hdl=%u\r\n",
					p_gap_evt->conn_handle);
			}

			// Continue connectable advertising while peripheral-link capacity
			// remains. BtAdvStart counts only peripheral-role links.
			if (role == BLE_GAP_ROLE_PERIPH)
			{
				BtAdvStart();
			}
		}
			break;

		case BLE_GAP_EVT_DISCONNECTED:
		{
			uint16_t connHdl = p_ble_evt->evt.gap_evt.conn_handle;
			BtDevice_t *pPeer = BtPeerFindByHdl(connHdl);

			SecurePendingRemove(connHdl);
			BtSmpOobDataClearConn(connHdl);
			BtPeerFree(pPeer);

			if (BtPeerIsConnected())
			{
				g_BtAppData.State = BTAPP_STATE_CONNECTED;
			}
			else
			{
				g_BtAppData.State = BTAPP_STATE_IDLE;
				BtAppConnLedOff();
			}

			BtAppEvtDisconnected(connHdl);

			if (g_BtAppData.AppDevice.Conn.Role & (BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))
			{
				BtAdvStart();
			}
		}
			break;

		case BLE_GAP_EVT_CONN_SEC_UPDATE:
		{
			const ble_gap_conn_sec_t *pcs = &p_gap_evt->params.conn_sec_update.conn_sec;
			// Capture the negotiated encryption key size for BtGapConnSecGet.
			// pm_conn_sec_status_get does not report key size; this event does.
			BtDevice_t *pdev = BtPeerFindByHdl(p_gap_evt->conn_handle);
			if (pdev != nullptr)
			{
				pdev->Conn.Sec.KeySize = pcs->encr_key_size;
			}
		}
			break;

		case BLE_GAP_EVT_PASSKEY_DISPLAY:
		{
			const ble_gap_evt_passkey_display_t *pPd =
					&p_gap_evt->params.passkey_display;
			uint16_t connHdl = p_gap_evt->conn_handle;
			uint32_t val = BmPasskeyToVal(pPd->passkey);
			if (pPd->match_request)
			{
				// LESC Numeric Comparison: the application confirms the match
				// through BtSmpNumericComparisonReply.
				BtSmpNumericComparison(connHdl, val);
			}
			else
			{
				// Passkey Entry display side: show the value the peer enters.
				BtSmpPasskeyDisplay(connHdl, val);
			}
		}
			break;

		case BLE_GAP_EVT_AUTH_KEY_REQUEST:
			if (p_gap_evt->params.auth_key_request.key_type ==
				BLE_GAP_AUTH_KEY_TYPE_PASSKEY)
			{
				// Passkey Entry input side: the application provides the value
				// through BtSmpPasskeyReply.
				BtSmpPasskeyRequest(p_gap_evt->conn_handle);
			}
			break;

		case BLE_GAP_EVT_ADV_SET_TERMINATED:
			BtAdvBmTerminated();
			BtAppAdvTimeoutHandler();
			break;

		case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
		{
			const ble_gap_phys_t phys = {
				BLE_GAP_PHY_AUTO,
				BLE_GAP_PHY_AUTO,
			};
			err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
			(void)err_code;
		}
		break;

		case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST:
		{
			ble_gap_data_length_params_t dl_params;
			memset(&dl_params, 0, sizeof(dl_params));
			err_code = sd_ble_gap_data_length_update(
				p_ble_evt->evt.gap_evt.conn_handle, &dl_params, NULL);
			(void)err_code;
		}
		break;

		case BLE_GATTS_EVT_SYS_ATTR_MISSING:
			// The event names the link that is missing them.
			err_code = sd_ble_gatts_sys_attr_set(
				p_ble_evt->evt.gatts_evt.conn_handle, NULL, 0, 0);
			(void)err_code;
			break;

		case BLE_EVT_USER_MEM_REQUEST:
			{
				// Long write: hand the SoftDevice this link's reassembly buffer.
				// Replied once per connection (not per service) to avoid
				// multiple sd_ble_user_mem_reply calls on the same request.
				BtDevice_t *pConn = BtPeerFindByHdl(p_ble_evt->evt.common_evt.conn_handle);
				if (pConn != nullptr && pConn->Conn.pLongWrBuff != nullptr)
				{
					ble_user_mem_block_t mblk;
					memset(&mblk, 0, sizeof(mblk));
					mblk.p_mem = pConn->Conn.pLongWrBuff;
					mblk.len   = pConn->Conn.LongWrBuffSize;
					memset(pConn->Conn.pLongWrBuff, 0, pConn->Conn.LongWrBuffSize);
					err_code = sd_ble_user_mem_reply(p_ble_evt->evt.common_evt.conn_handle, &mblk);
					(void)err_code;
				}
			}
			break;

		case BLE_GATTC_EVT_TIMEOUT:
			sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
								  BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
			break;

		case BLE_GATTS_EVT_TIMEOUT:
			sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
								  BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
			break;

		case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
		{
			uint16_t mtu = g_BtAppData.AppDevice.Conn.MaxMtu;
			err_code = sd_ble_gatts_exchange_mtu_reply(
				p_ble_evt->evt.gatts_evt.conn_handle, mtu);
			(void)err_code;
		}
		break;

		default:
			break;
	}

	// Forward to central/observer handlers. This asks what the device is
	// configured to do, not what its role is on one link: the scan report and
	// the scan timeout below carry no connection handle at all, and the
	// controller only delivers GATTC events on links where this side is the
	// client. The local record holds the BTAPP_ROLE_* capability bitmask.
	//
	// There used to be a "role == BLE_GAP_ROLE_CENTRAL" term in front of this.
	// role was a local copy of that same capability bitmask, so comparing it to
	// a per-link BLE_GAP_ROLE_* value asked nothing meaningful; c47258c5 removed
	// the local when it gave the connected event its real role and left this
	// use behind.
	if (g_BtAppData.AppDevice.Conn.Role & (BTAPP_ROLE_CENTRAL | BTAPP_ROLE_OBSERVER))
	{
		switch (p_ble_evt->header.evt_id)
		{
			case BLE_GAP_EVT_ADV_REPORT:
			{
				const ble_gap_evt_adv_report_t *p_adv_report =
					&p_gap_evt->params.adv_report;
				bool keep_going = BtAppScanReport(p_adv_report->rssi,
								p_adv_report->peer_addr.addr_type,
								(uint8_t *)p_adv_report->peer_addr.addr,
								p_adv_report->data.len,
								p_adv_report->data.p_data);
				// S145 stops reporting after each adv packet; the app must
				// re-arm the scan or explicitly stop it.
				if (keep_going)
				{
					BtAppScan();
				}
				else
				{
					BtAppScanStop();
				}
			}
			break;

